import { TeamInfo } from './team-inform.interface';

export const teamInformList: TeamInfo[] = [
  {
    name: 'Кунтий Олег',
    description:
      'дириґент одного з найвідоміших колективів України НАОНІ оркестра, переможець шоу «Битва оркестрів».Співпрацював з ONUKA, «ТІК», «Друга ріка», співаками Христиною Соловій, Олегом Скрипкою, Артемом Півоваровим. ',
    image: 'assets/team/Kuntyy.jpg',
  },
  {
    name: 'Олесь Журавчак',
    description:
      'музикант-віртуоз, культуролог, арт-менеджер, продюсер, Заступник Міністра культури України (2014), директор-розпорядник Національного академічного оркестру народних інструментів України.',
    image: 'assets/team/juravchak.jpg',
  },
  {
    name: 'Олександр Жищенко',
    description:
      'звукорежисер, аранжувальник, композитор, засновник, першого в Україні лейблу з випуску авторських дисків в стилі електронної музики Innertion records. Співпрацював з O.Torvald, VRODA, Колбасний цех, Хонгильдон, Gorchitza, Без Обмежень, Марія Бурмака, Kozak System, Allois, НАОНІ, театр КРОТ, Зернятко, Горлиця. У 2000 створив гурт Tomato Jaws з якого народився проект ONUKA.',
    image: 'assets/team/gyschenco.jpg',
  },
  {
    name: 'Тарас Столяр',
    description:
      'переможець Першого Міжнародного конкурсу виконавців на українських народних інструментах ім. Гната Хоткевича, артист Національного академічного оркестру народних інструментів України, Заслужений артист України.',
    image: 'assets/team/stolar.jpg',
  },
  {
    name: 'Ігор Брухаль',
    description:
      'музикант-віртуоз, викладач, лауреат Міжнародних та Всеукраїнських конкурсів, Заслужений артист України.',
    image: 'assets/team/bruchal.jpg',
  },
  {
    name: 'Любомир Матейко',
    description:
      'народний артист України, головний диригент, художній керівник, соліст-скрипаль та аранжувальник, співзасновник Київського ансамблю української музики «Дніпро».',
    image: 'assets/team/mateyko.jpg',
  },
  {
    name: 'Назар Павленко',
    description:
      'артист Національного академічного оркестру народних інструментів України, співпрацював з O.Torvald, Wannawakemusic, українським гуртом GONTA.',
    image: 'assets/team/pavlenko.jpg',
  },
  {
    name: 'Олег Микитюк',
    description:
      'музикант, аранжувальник, диригент, викладач кафедри баяна та акордеона Національної музичної академії України ім. П. І. Чайковського.',
    image: 'assets/team/mykytuk.jpg',
  },
  {
    name: 'Денис Савельєв',
    description:
      'український флейтист, котрий підкорив кращі концертні майданчики світу, серед яких Карнегі Хол, Кеннеді Центр, Лінкольн Центр, Метрополітен Музей, Симфонічний  Зал Шанхаю та Санторі Хол у Токіо. ',
    image: 'assets/team/savelev.jpg',
  },
  {
    name: 'Нікіта Рубченко',
    description:
      ' рок-музикант, композитор, аранжувальник. Співпрацював з багатьма відомими виконавцями та колективами.',
    image: 'assets/team/rubchenko.jpg',
  },
  {
    name: 'Петро Січко',
    description:
      'заслужений артист України, викладач Львівського музичного фахового коледжу ім. С.Людкевича, артист в оркестрі Національного драматичного театру імені М. Заньковецької.',
    image: 'assets/team/sichko.jpg',
  },
  {
    name: 'Андій Бобрик',
    description:
      'музикант, викладач Львівської національної музичної академії імені Миколи Лисенка та Львівського музичного фахового коледжу ім. С.Людкевича.',
    image: 'assets/team/bobryk.jpg',
  },
];
