import { CompetitionsInform } from 'src/app/shared/competitions-inform.model';
import { LaureatInfo } from 'src/app/shared/laureatInfo.model';

export const competitionsInfo: CompetitionsInform[] = [
  new CompetitionsInform('Зимовий конкурс 2022', 'RfQm0j6gzHQ', [
    new LaureatInfo(
      'Денис Герман',
      'Молодша',
      'laureats2022/DenysHerman.jpg',
      'Юний талановитий учень Ходорівської музичної школи мистецтв ім.Б.Ю.Янівського. Денис хотів навчатися гри на скрипці, та склалося так, що навчається гри на гітарі у класі пана Мирослава Презляти. Юнак є активним учасником шкільного мистецького життя, бере участь у концертах, грає в ансамблі. Хлопець тільки розпочав свій шлях у музиці і це перший для нього конкурс',
      'Гітара',
      'лауреат другої премії'
    ),
    new LaureatInfo(
      'Даниїл Ткачук',
      'Молодша',
      'laureats2022/DanyilTkachuk.jpg',
      "Вперше Даниїл почув сопілку, коли йому було п'ять років. Очі маленького хлопчика загорілися і найзаповітніше бажання було відтоді тільки одне - навчитися грати на цьому інструменті. Та на навчання в музичну школу його взяти не могли, вік не дозволяв. Мама хлопчика не здалася і таки впросила директора дозволити її сину вчитися. Даниїл - учень допитливий, захоплений навчанням, постійно займається, відточуючи майстерність та навчаючись новому, в своєї вчительки, пані Мар'яни Томашівської. Зараз Даниїл Ткачук є справжньою гордістю Дитячої школи мистецтв  ім.М.Вериківського, що у місті Кременець.",
      'Cопілка',
      'лауреат третьої премії'
    ),
    new LaureatInfo(
      'Маркіян Оринич',
      'Молодша',
      'laureats2022/MarkiyanOrynych.jpg',
      'Сестричка Маркіяна навчалася гри на бандурі і хлопець горів бажанням теж стати учнем Белзької мистецької школи. Це зовсім інший світ, який хлопцеві подобався і манив. В 9 років він взяв до рук скрипку і з того часу сумлінно опановує мистецтво гри на цьому інструменті в класі пані Галини Пшеницької. Його обдарованість і працелюбність тішать гарними результатами. Маркіян, неодноразово, ставав лауреатом міжнародних конкурсів, є постійним учасником концертів. ',
      'Скрипка',
      'лауреат другої премії'
    ),
    new LaureatInfo(
      'Тимофій Довгань',
      'Молодша',
      'laureats2022/TymofiiDovhan.jpg',
      'Юний музикант з славетного міста Тернопіль. Цей хлопець, з серйозним і розумним поглядом, навчається у Тернопільській музичній школі №2 імені Михайла Вербицького. Де вже другий рік опановує гру на цимбалах, інструменті, що заворожує багатством тембрів і забарвлень.',
      'Цимбали',
      'лауреат першої премії'
    ),
    new LaureatInfo(
      'Назар Біляк',
      'Середня',
      'laureats2022/NazarBilyak.jpg',
      'Юнакові зараз шістнадцять років, шість із них, він навчається грі на гітарі у стінах Дитячої школи мистецтв ✓5 міста Львова. Назару поталанило зустріти справжнього вчителя і наставника пана Віктора Каліту, котрий прищепив учню не лише любов до інструменту, а навчив наполегливо працювати, навчатися новому, постійно відточувати виконавську майстерність. Назар вже є лауреатом численних міжнародних та всеукраїнських конкурсів. Концертує як соліст і у складі оркестру школи "Цвіт нації", здобуваючи сценічний досвід.',
      'Гітара',
      'лауреат третьої премії'
    ),
    new LaureatInfo(
      'Адам Аль Кальха',
      'Молодша',
      'laureats2022/AdamAlKalcha.jpg',
      "Зараз Адаму чотирнадцять і вже двічі війна змушувала його родину залишати домівку. Народився юнак у Луганську.У 2014 році сім'я переїхала до Києва і хлопець, котрий з дитинства мріяв навчитися грати на гітарі, прийшов здавати вступні екзамени в Київську школу мистецтв ✓6 імені Г.Л. Жуковського. Та волею долі склалося так, що навчатися почав гри на тромбоні. Талант і майстерність вчителя посіяли в серці Адама справжню любов до цього інструменту. 24 лютого, коли його сім'я залишала Київ, єдине що взяв з собою Адам, був тромбон. Зараз родина хлопця проживає у Німеччині. Де талант юнака одразу помітили і запросили грати у  міській капелі міста Brakel, якою керують Henrik Laufer та Natascha Flormann та у музичному колективі міста Höxter під керівництвом Florian Schachber. Адам продовжує своє онлайн навчання в школі мистецтв і щодня працює над своєю технікою та виконавською майстерністю.",
      'Тромбон',
      'лауреат першої премії'
    ),
    new LaureatInfo(
      'Володимир Висоцький',
      'Старша',
      'laureats2022/VolodymyrVysockyi.jpg',
      'Акордеоніст-віртуоз, родом зі Львова. Володимир лауреат численних всеукраїнських та міжнародних конкурсів, учасник колективу Resonance trio, концертуючий музикант, співзасновником щорічного фестивалю-концерту “Акордеонна осінь”, викладач Львівської державної  хорової школи «Дударик» імені Миколи Кацала.Музиці і улюбленому інструменту насправді присвятив своє життя. І цей вибір зробив свідомо, у 2010 році ставши студентом тодішнього Львівського державного музичного училища імені Станіслава Людкевича. Далі роки навчання у Львівській національній музичній академії імені Миколи Лисенка. Активна концертна діяльность, участь у мистецьких проектах і робота в одній з найзнаменитіших мистецьких шкіл Львова.',
      'Акордеон',
      'лауреат першої премії'
    ),
    new LaureatInfo(
      'Софія Щерба',
      'Середня',
      'laureats2022/SofiyaScherbova.jpg',
      "Талановита і творча, чарівна львів'янка.Софія народилася і зростала у древньому, величному Львові де живе дух історії, любові до свого краю, своєї культури і традицій. З бандурою пов'язані всі свідомі роки життя Софії. Вона навчалася у Львівській музичній школі ✓2, а зараз навчається у знаному і шанованому вузі, який виховав не одне покоління видатних музикантів,  Львівському фаховому музичному коледжі імені Станіслава Людкевича, у класі пані Марії Наконечної.",
      'Бандура',
      'лауреат другої премії'
    ),
    new LaureatInfo(
      'Дмитро Таряник',
      'Старша',
      'laureats2022/DmytroTaryanyk.jpg',
      'Родом з міста Тростянець, що на Сумщині. Там і почав робити свої перші кроки в світ великої музики, розуміючи що хоче їй  присвятити своє життя. Всупереч волі батьків, котрі хотіли бачити сина в білому лікарському халаті, у вісімнадцять поїхав до Полтави і став студентом Полтавського музичного училища імені М.В.Лисенка. Далі було підкорення столиці. Навчання в Національній Музичній Академії України імені П.І.Чайковського, праця солістом оркестру Київської опери і викладацька діяльність у Київській дитячій музичній школі імені І.Шамо, де Дмитро з захопленням  навчає юних музикантів і відкриває їм двері у прекрасний світ музики і мистецтва.',
      'Труба',
      'лауреат другої премії'
    ),
    new LaureatInfo(
      'Микола Савчук',
      'Середня',
      'laureats2022/MykolaSavchuck.jpg',
      "Молодий юнак з бандурою в руках,  уродженець міста Золочів, що на Львівщині.Золочівщина славиться своєю бандурною школою, і виховала не одне покоління музикантів-бандуристів.Саме в Золочівській музичній школі посіяли в серці хлопця любов до цього давнього інструменту. І ця любов до бандури продовжує жити, і саме з бандурою Микола пов'язав своє життя. Зараз Микола навчається на третьому курсі Львівського музичного фахового коледжу ім. Станіслава Людкевича по класу бандури у пані Марії Наконечної.В Миколи вже є перемоги на конкурсах. І ми впевнені, що кількість цих здобутих перемог тільки збільшуватиметься з року в рік.",
      'Бандура',
      'лауреат третьої премії'
    ),
    new LaureatInfo(
      'Гнат Мєрєнков',
      'Сташа',
      'laureats2022/GnatMerenkov.jpg',
      'Народився Гнат в Києві, але шкільні роки пройшли в селищі Голубівське Луганської області. Пішов шляхом мами і закінчив Східноукраїнський національний університет ім. Володимира Даля за спеціальністю «Журналістика». Жив і працював у Луганську. Тривалий час працював редактором студентської газети в Луганській державній академії культури і мистецтв. У Луганську, вже в дорослому віці почав самостійно вчитися грати на сопілці, був учасником фольклорного ансамблю. 2014 рік змінив багато у житті Гната. З Луганська він був вимушений поїхати. Зараз живе і займається журналістсько-редакторської діяльністі на Київщині. Та музику не залишає і далі продовжує навчатися, розвиватися, експериментувати, писати власні композиції співпрацюючи з іншими музикантами. Весною 2022 року випустив першу поетичну збірку «Народжене з тиші».',
      'Сопілка',
      'особлива відзнака'
    ),
    new LaureatInfo(
      'Олена Немеш',
      'Старша',
      'laureats2022/OlenaNemesch.jpg',
      'Все життя Олени тісно переплетене з бандурою. Вона не розлучається з нею з дитинства. З років навчання у Дитячій школі мистецтв міста Бровари, де перша вчителька, Світлана Фадеєва, заклала фундамент на майбутнє. Далі роки навчання в КМАМ імені Р.Г. Глієра, по класу бандури у Ольги Туровської, навчання композиції у заслуженого діяча мистецтв України, композитора Геннадія Саська. І важлива подія у житті Олени, у 2018 році вона стає членом спілки бандуристів України. Пише власні твори для бандури-соло, капели бандуристів, оркестру. Олена в числі учасників конкурсу композиторів, за який вдячна НАОНІ, адже цей конкурс дав можливість молодій композиторці спробувати свої сили у жанрі оркестрової музики. Зараз, Олена продовжує своє навчання у стінах Національної музичної академії України, в класі професорки Людмили Федорової-Коханської. Виконання конкурсної програми і біографія, що надіслала нам Олена,  говорять, що перед нами талановита, розумна і свідома справжня українка. Для нас честь, бачити Олену у складі першого онлайн оркестру Orchestra challenge!',
      'Бандуа',
      'Лауреат першої премії'
    ),
    new LaureatInfo(
      'Тетяна Середенко',
      'Середня',
      'laureats2022/TetyanaSeredenko.jpg',
      'Родом Тетяна з мальовничого міста Чернівці. Зростала дівчина посеред природної краси і дивовижної архітектури міста, що надихає до творчості і мистецтва. Зараз Тетяна навчається на третьому курсі  Чернівецього обласного фахового коледжу мистецтв ім.С.Воробкевича по класу бандури в української композиторки Ольги Гук. Молода красуня-бандуристка неодноразово ставала лауреаткою обласних, всеукраїнських та міжнародних конкурсів, робить перші спроби в композиції.',
      'Бандура',
      'Лауреат першої премії'
    ),
    new LaureatInfo(
      'Катерина Заславська',
      'Молодша',
      'laureats2022/KaterynaZaslavska.jpg',
      'Як ніжно співає скрипка в руках ще зовсім юної Катрусі, учениці Жовківської дитячої школи мистецтв, що на Львівщині.Ця талановита дівчинка навчається гри на скрипці лише чотири роки в класі пані Наталії Бандури, а вже є лауреатом Всеукраїнських і Міжнародних конкурсів, бере участь в багатьох концертах.',
      'Скрипка',
      'Лауреат першої премії'
    ),
    new LaureatInfo(
      'Анна Шаповал',
      'Старша',
      'laureats2022/AnnaSchapoval.jpg',
      'Чарівні переливи бандурних струн супроводжують Анну все її життя, голосом бандури вона ділиться з світом своїми почуттями і думками. Анна, лауреатом та дипломантом багатьох конкурсів, концертує як солістка, і як учасниця ансамблів, бере участь у фестивалях, презентує нашу українську культуру на дипломатичних заходах в різних країнах Європи. Народилася у селищі Баришівка, що на Київщині, а стінах Київської дитячої музичної школи №20 вперше взяла до рук бандуру. І відтоді з нею не розлучається, а навпаки, тісно переплітає своє життя з цим давнім українським інструментом. Закінчує Київську муніципальну академію музики ім. Р.М. Глієра, Національну музичну академію України ім. П.І.Чайковського і зараз ще продовжує своє навчання в стінах академії, як асистент-стажист кафедри бандури та працює викладачем бандури та вокалу у Київській дитячій школі мистецтв №1. Можна довго підбирати слова, щоб розповісти вам, як заворожено ми слухали відеозапис конкурсної програми Анни. Та краще послухай і пориньте у цей чарівний передзвін бандурних струн! Посилання знайдете на нашій сторінці у Facebook.',
      'Бандура',
      'Лауреат другої премії'
    ),
    new LaureatInfo(
      'Іван Збіглі',
      'Старша',
      'laureats2022/IvanZbigli.jpg',
      'Лауреат Міжнародних та Всеукраїнських конкурсів, володар І премії престижного конкурсу баяністів-акордеоністів International Open Trophy, провадить активну концертну діяльність, поєднуючи її з навчанням і роботою викладача, пише власні аранжування для ансамблів та колективів. Родом з села Чудей, Чернівецької області і в місцевій музичній школі відкрив для себе світ музики. А перший вчитель, Андрія Пожога, зумів посіяти в серці учня зерна справжньої любові до інструменту і мистецтва. Далі роки навчання в Чернівецькому училищі мистецтв ім. С. Воробкевича, Навчально-науковому інституті мистецтв, Прикарпатського національного університету ім. В. Стефаника, робота в Снятинській музичній школі, знову навчання в Навчально-науковому інституті мистецтв вже по класу цимбал.',
      'Акордеон',
      'Лауреат другої премії'
    ),
    new LaureatInfo(
      'Надія Галан',
      'Молодша',
      'laureats2022/NadiyaGalan.jpg',
      'Талановита учениця Дитячої школи мистецтв ✓5 м.Львова, учасниця багатьох концертів, переможниця конкурсів і фестивалів. Надійка щодня приходить до школи і годинами грає, відточуючи майстерність і невтомно навчаючись нового у батька і вчителя Ярослава Галана. Партія ксилофону, у партитурі твору для першого в Україні онлайн оркестру Orchestra challenge, написана саме для цієї обдарованої і працьовитої дівчини.',
      'Ксилофон',
      'Лауреат першої премії'
    ),
    new LaureatInfo(
      'Анастасія Макар',
      'Молодша',
      'laureats2022/AnastasiyaMakar.jpg',
      'Юна, талановита, красуня-бандуристка, котра полонила серце головного диригента Orchestra challenge Олега Кунтого. Привідкриємо таємницю, Олег навіть вніс корективи в партитуру спільного твору побачивши запис конкурсного відео Насті. Анастасія навчається в Пустомитівській школі мистецтв, що на Львівщині, в класі пані Наталії Фурман. Власне почувши, як звучить бандура в руках пані Наталі, Настя сказала:- "Я хочу, і я буду вчитися!!!"',
      'Бандура',
      'Лауреат першої премії'
    ),
    new LaureatInfo(
      'Микола Тимчак',
      'Старша',
      'laureats2022/MykolaTymchak.jpg',
      "Родом з селища Великий Бичків, що на Закарпатті. Навчався в музичній школі по класу баяна і сопілки, традиційно грав в сімейній 'Троїстій музиці', а потім забув про музику на довгих 25 років. Декілька років тому йому до рук випадково потрапила сопілка, спробував пригадати шкільну науку і зрозумів, що не лише добре пам'ятає, а й дуже сумує за звуками цього давнього українського інструменту. Зараз у Миколи найбільша в Європі колекція українських сопілок та сопілок з Карпат.",
      'Сопілка',
      'особлива відзнака'
    ),
  ]),
  new CompetitionsInform('Зимовий конкурс 2023', 'RfQm0j6gzHQ', [
    new LaureatInfo(
      'Олег',
      'Старша',
      'orchestra_logo.png',
      'Вася був парубок моторний',
      'Сопілка',
      'Лауреат першої премії'
    ),
    new LaureatInfo(
      'Дмитро',
      'Молодша',
      'orchestra_logo.png',
      'Петя був парубок моторний',
      'Ліра',
      'Лауреат другої премії'
    ),
  ]),
];
